In [5]:
import pandas as pd

df = pd.read_csv("sample_employee_data.csv")

df.head()

   EmployeeID     Name Department  Salary  YearsAtCompany  BonusPercentage
0         101    Alice         HR   50000               2             0.10
1         102      Bob    Finance   60000               5             0.15
2         103  Charlie         IT   55000               3             0.12
3         104    Diana         HR   52000               4             0.10
4         105     Evan         IT   58000               1             0.08

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   EmployeeID       5 non-null      int64
 1   Name             5 non-null      object
 2   Department       5 non-null      object
 3   Salary           5 non-null      int64
 4   YearsAtCompany   5 non-null      int64
 5   BonusPercentage  5 non-null      float64
dtypes: float64(1), int64(3), object(2)
memory usage: 372.0+ bytes

In [9]:
df.describe()

       EmployeeID        Salary  YearsAtCompany  BonusPercentage
count    5.000000      5.000000        5.000000         5.000000
mean   103.000000  55000.000000        3.000000         0.110000
std      1.581139   4123.105626        1.581139         0.026458
min    101.000000  50000.000000        1.000000         0.080000
25%    102.000000  52000.000000        2.000000         0.100000
50%    103.000000  55000.000000        3.000000         0.100000
75%    104.000000  58000.000000        4.000000         0.120000
max    105.000000  60000.000000        5.000000         0.150000

In [11]:
df.shape

(5, 6)

In [13]:
df.columns

Index(['EmployeeID', 'Name', 'Department', 'Salary', 'YearsAtCompany',
       'BonusPercentage'],
      dtype='object')

In [15]:
df['Bonus'] = df['Salary'] * df['BonusPercentage']
df['TotalPay'] = df['Salary'] + df['Bonus']
df.head()

,EmployeeID,Name,Department,Salary,YearsAtCompany,BonusPercentage,Bonus,TotalPay
0,101,Alice,HR,50000,2,0.10,5000.0,55000.0
1,102,Bob,Finance,60000,5,0.15,9000.0,69000.0
2,103,Charlie,IT,55000,3,0.12,6600.0,61600.0
3,104,Diana,HR,52000,4,0.10,5200.0,57200.0
4,105,Evan,IT,58000,1,0.08,4640.0,62640.0

In [17]:
df.columns

Index(['EmployeeID', 'Name', 'Department', 'Salary', 'YearsAtCompany',
       'BonusPercentage', 'Bonus', 'TotalPay'],
      dtype='object')

In [19]:
df.shape

(5, 8)

In [21]:
df[df['TotalPay']== df['TotalPay'].max()]

,EmployeeID,Name,Department,Salary,YearsAtCompany,BonusPercentage,Bonus,TotalPay
1,102,Bob,Finance,60000,5,0.15,9000.0,69000.0

In [25]:
df.groupby('Department')['Bonus'].mean()

Department
Finance    9000.0
HR         5100.0
IT         5620.0
Name: Bonus, dtype: float64

In [42]:
df.groupby('Department')['Salary'].mean().sort_values(ascending=False)

Department
Finance    60000.0
IT         56500.0
HR         51000.0
Name: Salary, dtype: float64

In [46]:
df.sort_values(by ='TotalPay', ascending = False)

,EmployeeID,Name,Department,Salary,YearsAtCompany,BonusPercentage,Bonus,TotalPay
1,102,Bob,Finance,60000,5,0.15,9000.0,69000.0
4,105,Evan,IT,58000,1,0.08,4640.0,62640.0
2,103,Charlie,IT,55000,3,0.12,6600.0,61600.0
3,104,Diana,HR,52000,4,0.10,5200.0,57200.0
0,101,Alice,HR,50000,2,0.10,5000.0,55000.0

In [48]:
df[df['YearsAtCompany']>3]

,EmployeeID,Name,Department,Salary,YearsAtCompany,BonusPercentage,Bonus,TotalPay
1,102,Bob,Finance,60000,5,0.15,9000.0,69000.0
3,104,Diana,HR,52000,4,0.10,5200.0,57200.0